# 1. 행(row)데이터 추출하기
+ **연속적인 데이터인 경우 파이썬 슬라이싱(slicing) 기능을 이용**
+ **불연속적으로 데이터를 추출하기 위해서는 loc[...]함수를 이용**

In [29]:
import pandas as pd
df1 = pd.read_csv("data/LEC_03_data.csv")
df1

    Name Country  Age        Job
0   John     USA   31    Student
1  Sabre  France   33     Lawyer
2    Kim   Korea   28  Developer
3   Sato   Japan   40       Chef
4    Lee   Korea   36  Professor
5  Smith     USA   55        CEO

# 연속적인 행 데이터 추출

In [30]:
# 첫 행부터 인덱스 2 행 (3-1) 까지
df1[:3]

    Name Country  Age        Job
0   John     USA   31    Student
1  Sabre  France   33     Lawyer
2    Kim   Korea   28  Developer

In [31]:
# 인덱스 3 행부터 4 행의 데이터
df1[3:5]

   Name Country  Age        Job
3  Sato   Japan   40       Chef
4   Lee   Korea   36  Professor

In [32]:
# 인덱스 4행부터 끝까지
df1[4:]

    Name Country  Age        Job
4    Lee   Korea   36  Professor
5  Smith     USA   55        CEO

# 불연속적인 행 데이터 추출

In [33]:
# 0행 데이터
df1.loc[0] # Series 리턴

Name          John
Country        USA
Age             31
Job        Student
Name: 0, dtype: object

In [34]:
# 0행, 3행 데이터
df1.loc[[0,3]] # DataFrame 리턴

   Name Country  Age      Job
0  John     USA   31  Student
3  Sato   Japan   40     Chef

In [35]:
# 1행, 2행, 5행데이터
df1.loc[[1,2,5]]

    Name Country  Age        Job
1  Sabre  France   33     Lawyer
2    Kim   Korea   28  Developer
5  Smith     USA   55        CEO

# 2. 열(column)데이터 추출하기 - 열 이름(name)을 이용한 데이터 추출
데이터 프레임 변수를 df라고 할경우
+ **df.열이름 또는 df['열이름']을 이용하여 하나의 열 데이터를 가져올 수 있으며**
+ **2개 이상의 열 데이터를 가져오기 위해서는 다음과 같이 df[['열 이름1', '열 이름2'], ...] 리스트 타입을 이용하여 복수개의 열 데이터를 가져올 수 있음**

In [36]:
df1

    Name Country  Age        Job
0   John     USA   31    Student
1  Sabre  France   33     Lawyer
2    Kim   Korea   28  Developer
3   Sato   Japan   40       Chef
4    Lee   Korea   36  Professor
5  Smith     USA   55        CEO

# 하나의 열 데이터 추출

In [37]:
df1['Country'] # Series 타입 리턴

0       USA
1    France
2     Korea
3     Japan
4     Korea
5       USA
Name: Country, dtype: object

In [38]:
df1.Country # Series 타입 리턴

0       USA
1    France
2     Korea
3     Japan
4     Korea
5       USA
Name: Country, dtype: object

# 2개 이상의 열 데이터 추출

In [39]:
df1[['Name', 'Age']]

    Name  Age
0   John   31
1  Sabre   33
2    Kim   28
3   Sato   40
4    Lee   36
5  Smith   55

In [40]:
df1[['Name','Age','Job']]

    Name  Age        Job
0   John   31    Student
1  Sabre   33     Lawyer
2    Kim   28  Developer
3   Sato   40       Chef
4    Lee   36  Professor
5  Smith   55        CEO

# 3. 열 인덱스를 이용한 데이터 추출
**열 인덱스(index)만 있는 경우에는 파이썬 슬라이싱과 iloc[...]함수를 이용하여 열 데이터를 추출할 수 있음**

In [41]:
df2 = pd.read_csv("data/LEC_03_data_no_header.csv", header=None)
df2

       0       1   2          3
0   John     USA  31    Student
1  Sabre  France  33     Lawyer
2    Kim   Korea  28  Developer
3   Sato   Japan  40       Chef
4    Lee   Korea  36  Professor
5  Smith     USA  55        CEO

In [44]:
# 모든 행, 1열 부터 2열까지
df2.iloc[:,1:3]

        1   2
0     USA  31
1  France  33
2   Korea  28
3   Japan  40
4   Korea  36
5     USA  55

In [45]:
# 1행부터 3행, 2열부터 끝까지
df2.iloc[1:4, 2:]

    2          3
1  33     Lawyer
2  28  Developer
3  40       Chef

In [46]:
# 모든 행, 0열, 2열, 3열
df2.iloc[:,[0, 2, 3]]

       0   2          3
0   John  31    Student
1  Sabre  33     Lawyer
2    Kim  28  Developer
3   Sato  40       Chef
4    Lee  36  Professor
5  Smith  55        CEO

In [47]:
# 1행 3행, 1열, 3열
df2.iloc[[1,3],[1,3]]

        1       3
1  France  Lawyer
3   Japan    Chef

# 조건에 따른 데이터 추출

**데이터프레임의 연산자(>,==,!=,&,|등)을 이용하여 열 데이터를 추출할 수 있음**

In [48]:
df1

    Name Country  Age        Job
0   John     USA   31    Student
1  Sabre  France   33     Lawyer
2    Kim   Korea   28  Developer
3   Sato   Japan   40       Chef
4    Lee   Korea   36  Professor
5  Smith     USA   55        CEO

In [49]:
# Country가 Korea인 경우
df1[df1.Country=='Korea']

  Name Country  Age        Job
2  Kim   Korea   28  Developer
4  Lee   Korea   36  Professor

In [50]:
# Age가 > 30 인 경우
df1[df1.Age > 30]

    Name Country  Age        Job
0   John     USA   31    Student
1  Sabre  France   33     Lawyer
3   Sato   Japan   40       Chef
4    Lee   Korea   36  Professor
5  Smith     USA   55        CEO

In [52]:
# Country != 'Usa' & Age >= 36
# &, | 연산자를 사용할 때는 조건식을 괄호로 묶어 주어야 함
df1[(df1.Country != 'USA') & (df1.Age >= 36)]

   Name Country  Age        Job
3  Sato   Japan   40       Chef
4   Lee   Korea   36  Professor

In [54]:
# Country == Korea| Job = Chef
df1[(df1.Country == 'Korea') | (df1.Job=='Chef')]

   Name Country  Age        Job
2   Kim   Korea   28  Developer
3  Sato   Japan   40       Chef
4   Lee   Korea   36  Professor